{
  "title": "FY Representatives",
  "for": "FY Students",
  "about": "FY Rep allows you to actively participate in the college council's activities, gaining hands-on experience in event management, corporate engagement, teamwork, and community outreach. It also provides a platform to contribute to the council's continuous improvement and represent the interests of their peers.",
  "responsibilities": [
    "Face of Council: Representing First-Year Students and acting as a conduit for communication between the council and first-year students, ensuring their interests are considered.",
    "Learning and Development: Actively seek opportunities to learn about event management, corporate relations, and teamwork enhancing their skills and knowledge.",
    "Council Support and Engagement: Assist in the planning and execution of college events, including but not limited to, coding-related events, workshops, and seminars."  
  ],
  "skills": [
    "Enthusiasm and Willingness to Learn: Eagerness and Passion to expand their knowledge and skills.",
    "Problem-Solving Abilities: Ability to analyze problems and devise solutions.",
    "Initiative: Proactive approach to taking on tasks and responsibilities within the council.",
    "Teamwork and Collaboration: Ability to work effectively in teams and Respect for diverse perspectives and ideas within the coding council.",
    "Basic Coding Skills: Not necessary but better if Understanding of coding fundamentals and logic."
  ],
  "perks": [
    "Learning Opportunities: Exposure to real-world projects and challenges.",
    "Networking and Community: Connect with like-minded peers, seniors members and mentors for guidance.",
    "Skill Development: Development of coding and problem-solving skills, management skills and personality.",
    "Leadership and Responsibility: Chances to take on leadership roles within the council,responsibility of helping organize major events.",
    "Internship Credits: Get the internship hours for your work in the council"
  ],
  "procedure": [
    "Review of Resumes",
    "Interview Based",
    "Faculty Interview Based"
  ],
  "resume": "https://drive.google.com/drive/folders/1qMHUSixUEioBfmY8cxHYzLr3K062Rlfn?usp=sharing",
  "openings": "6 First Year Representatives"
}
