{
  "title": "FY Representatives",
  "for": "FY Students",
  "about": [
    "Elevate Your Potential with CSI-KJSCE as a First-Year Representatives. Engage actively in dynamic college council activities, gaining hands-on experience in event management, industrial relations, teamwork, and community outreach. Our council prioritizes excellence, seeking exceptional individuals who are ready for a unique opportunity. We are dedicated to your personal and professional growth, imparting skills that empower your industry success and personal development. Join CSI-KJSCE, where every day is a chance to learn, lead, and excel, positioning you ahead of your peers in all-round skills. Your brighter future starts here."
  ],
  "responsibilities": [
    "Be the voice of first-year students, facilitating communication between the council and peers.",
    "Embrace opportunities to learn about event management, corporate relations, and teamwork.",
    "Contribute to planning and executing council events, including coding-related activities and workshops."
  ],
  "skills": [
    "Enthusiasm and curiosity for expanding knowledge.",
    "Problem-solving proficiency and a different perspective.",
    "Proactive initiative and versatility in diverse teams.",
    "Fundamental Coding Aptitude and a desire to learn."
  ],
  "perks": [
    "Learning opportunities in challenging scenarios.",
    "Networking with peers, seniors, and mentors.",
    "Skill enhancement in coding, problem-solving, and management.",
    "Leadership roles in organizing major events.",
    "Internship accreditation for dedicated work within the council."
  ],
  "procedure": [
    "Shortlisting based on Submitted Resumes and Form Question responses [Top 40 Shortlisted]",
    "15-20 minute offline interviews with the Top 40 selected from Round 1, based on various aspects [Top 6 Shortlisted]",
    "Faculty interviews with the Top 6 selected FY Reps from Round 2 to finalize the selection [Top 6 Finalized]"
  ],
  "resume": [
    [
      "Research to understand what we are looking for because the best candidate is someone who understands what the recruiters want. Read the Job Description.",
      null
    ],
    [
      "Get familiar with resumes and their significance in the recruitment process. Watch this informative video [Here] to learn more.",
      "https://youtu.be/y8YH0Qbu5h4?si=vZfvwAFEycALN60T"
    ],
    [
      "To excel in the initial resume-based round, create a comprehensive resume that effectively highlights your achievements. Check this Resume Guide [Here].",
      "https://drive.google.com/file/d/1MKcnAh-3PYWc6Ox4zpuspJeOpu9G1AQ6/view?usp=sharing"
    ],
    [
      "Make use of user-friendly resume templates available on Canva, Overleaf, etc. Explore some templates [Here].",
      "https://www.canva.com/templates/?query=resume"
    ],
    [
      "Create your resume using the chosen template, review and meticulously proofread your resume to present yourself in the best possible light to us.",
      null
    ],
    [
      "Please make sure your Resume Google Drive or Docs link is public and not private, try opening the link in incognito mode to check if it is accessible.",
      null
    ]
  ],
  "openings": "6 First Year Representatives for the Academic Year 2023-24"
}
